'''Модуль полученных данных.

Реализация нашей версии MVP предполагает в перспективе наличие
подключенного API, который будет передавать информацию в константы.

Имеющиеся константы:
CEXS - список CEX бирж;
DEXS - словарь DEX бирж, с полученной c сайта стоимостью после падения;
SPECIFICS - поля данных, которые треуется в исследовании;
DATA_CEX - сухой набор данных, записанный в формате SPECIFICS.
    
'''

CEXS = ["Binance", "Gate.io", "FTX", "KuCoin", "Kraken"]
DEXS = {
    "1inch": 4551334, 
    "Uniswap": 2510763,
    }
SPECIFICS = ["price", "volume", "price_max", "price_min", "num_tokens"]
DATA_CEX = [
    [1.175, 558071574, 1.275, 1.075, 514240],
    [1.173, 9449879, 1.17, 1.175, 104425],
    [1.168, 3229871, 1.165, 1.171, 202422],
    [1.181, 4000019, 1.18, 1.182, 333421],
    [1.17, 2949872, 1.165, 1.175, 154423],
]
# DATA_CEX2 = [
#   [0.75, 126000000, 0.85, 0.65, 1000000],
#   [0.76, 2600000, 0.9, 0.65, 100000],
# ]            
TOKENS2 = ["USDT", "BTC"]
VALUES_RATE = {
    "BTC": 0.5,
    "BUSD": 0.8,
    "USDT": 1,
}
